In [1]:
import pandas as pd 
import numpy as np
import seaborn as sns 
import matplotlib.pyplot as plt
data = pd.read_excel(r"F:/aqar/remove_outlier.xlsx")

data.head()

,link,Adtitle,price,address,area,bedrooms,bathrooms,sale_or_rent,unit,aqar type,price/meter^2
0,https://aqarmap.com.eg//en/listing/4294910-for...,Shops For rent in Orium Mall - Z Group,140000,"اوريوم مول - زد جروب, كمبوند بمدينة الشروق",110,NaN,NaN,Y,commercial,commercial,1272.727273
1,https://aqarmap.com.eg//en/listing/4242338-for...,Shops For rent in Craft Zone Mall,25000,"كرافت زون مول, مدينتي",76,NaN,NaN,Y,commercial,commercial,328.947368
2,https://aqarmap.com.eg//en/listing/4354688-for...,Shops For rent in El Ahram St.,60000,"شارع الأهرام , ميدان روكسي",160,NaN,NaN,Y,commercial,commercial,375.000000
3,https://aqarmap.com.eg//en/listing/4224245-for...,Restaurant For rent in Moez El-Dawla St.,60000,"شارع معز الدولة, البنفسج 8",46,NaN,NaN,Y,commercial,commercial,1304.347826
4,https://aqarmap.com.eg//en/listing/4222905-for...,Shops For rent in El Shaheed Mohammed Alshimi St.,45000,"شارع الشهيد/ محمد الشيمي, البنفسج 8",46,NaN,NaN,Y,commercial,commercial,978.260870

In [2]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1442 entries, 0 to 1441
Data columns (total 11 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   link           1442 non-null   object
 1   Adtitle        1439 non-null   object
 2   price          1442 non-null   int64
 3   address        1442 non-null   object
 4   area           1442 non-null   int64
 5   bedrooms       1121 non-null   float64
 6   bathrooms      1104 non-null   float64
 7   sale_or_rent   1442 non-null   object
 8   unit           1442 non-null   object
 9   aqar type      1442 non-null   object
 10  price/meter^2  1442 non-null   float64
dtypes: float64(3), int64(2), object(6)
memory usage: 124.0+ KB

In [3]:
data.describe() #describe the statistics of numeric values

              price         area     bedrooms    bathrooms  price/meter^2
count  1.442000e+03  1442.000000  1121.000000  1104.000000    1442.000000
mean   3.907608e+06   219.377947     2.716325     2.155797   26111.660736
std    3.117187e+06   327.292212     0.790452     0.788174   21715.224880
min    1.100000e+04     9.000000     1.000000     1.000000       6.000000
25%    1.633500e+06   116.250000     2.000000     2.000000   12000.000000
50%    3.416000e+06   159.000000     3.000000     2.000000   22500.000000
75%    6.000000e+06   201.500000     3.000000     3.000000   40000.000000
max    1.322428e+07  6000.000000     5.000000     5.000000  162000.000000

In [4]:
data.isnull().sum()

link               0
Adtitle            3
price              0
address            0
area               0
bedrooms         321
bathrooms        338
sale_or_rent       0
unit               0
aqar type          0
price/meter^2      0
dtype: int64

In [5]:
data.shape

(1442, 11)

In [6]:
data.columns.values

array(['link', 'Adtitle', 'price', 'address', 'area', 'bedrooms',
       'bathrooms', 'sale_or_rent', 'unit', 'aqar type', 'price/meter^2'],
      dtype=object)

In [7]:
data.dtypes

link              object
Adtitle           object
price              int64
address           object
area               int64
bedrooms         float64
bathrooms        float64
sale_or_rent      object
unit              object
aqar type         object
price/meter^2    float64
dtype: object

In [22]:
data.select_dtypes(include='number')

        price  area  bedrooms  bathrooms  price/meter^2
0      140000   110       NaN        NaN    1272.727273
1       25000    76       NaN        NaN     328.947368
2       60000   160       NaN        NaN     375.000000
3       60000    46       NaN        NaN    1304.347826
4       45000    46       NaN        NaN     978.260870
...       ...   ...       ...        ...            ...
1437  4300000   220       3.0        2.0   19545.454545
1438  1250000    90       2.0        1.0   13888.888889
1439  1250000    90       2.0        1.0   13888.888889
1440  9800000   140       2.0        1.0   70000.000000
1441  1200000    42       1.0        1.0   28571.428571

[1442 rows x 5 columns]

In [9]:
data.nunique()

link             1116
Adtitle           870
price             508
address           542
area              248
bedrooms            5
bathrooms           5
sale_or_rent        2
unit                3
aqar type           2
price/meter^2     785
dtype: int64

In [10]:
plt.figure(figsize=(10,5))
d=data[['unit','aqar type','sale_or_rent']]
for  i,predictor in enumerate(d.drop(columns='aqar type')):
    plt.figure()
    sns.countplot(data=d,x=predictor,hue='sale_or_rent')

In [11]:
d.unit.value_counts()

apartment              792
furnished-apartment    339
commercial             311
Name: unit, dtype: int64

In [12]:
d.sale_or_rent.value_counts()/len(d)*100

N    78.432732
Y    21.567268
Name: sale_or_rent, dtype: float64

In [13]:
plt.figure(figsize=(6,6))
sns.heatmap(data.corr(),annot=True)

In [14]:
plt.figure(figsize=(10,5))
d['unit'].value_counts().sort_index(ascending=False).plot()

In [15]:
onehot=pd.get_dummies(data['unit'])
onehot

      apartment  commercial  furnished-apartment
0             0           1                    0
1             0           1                    0
2             0           1                    0
3             0           1                    0
4             0           1                    0
...         ...         ...                  ...
1437          0           0                    1
1438          0           0                    1
1439          0           0                    1
1440          0           0                    1
1441          0           0                    1

[1442 rows x 3 columns]

In [16]:
data['unit'].value_counts().plot(kind='barh',figsize=(8,6))
plt.xlabel("category",labelpad=14)
plt.ylabel("category",labelpad=14)
plt.title('',y=1.02)

Text(0.5, 1.02, '')

In [17]:
sns.lmplot(data=data,x='area',y='price',fit_reg=False)

In [18]:
data.plot()